app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 2)
---
  def destroy
    @project = Project.find(params[:id])