app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    @projects = Project.all

INSERT INTO "projects" ("pitch", "created_at", "updated_at", "summary", "owner") VALUES('Rails based web app that lets people create pitches for their ideas, find a project they like, and find the people that are working on that project.', '2009-11-22 03:13:49', '2009-11-22 03:13:49', 'Program to help people find things to work on at RailsCamp', NULL)
---
  def create
    @project = Project.new(params[:project])
    @project.owner_id = current_user.id

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 3)
UPDATE "projects" SET "updated_at" = '2009-11-22 08:36:16', "summary" = 'Let''s do stuff!' WHERE "id" = 3
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

DELETE FROM "projects" WHERE "id" = 2
---
  def destroy
    @project.destroy

SELECT * FROM "projects" WHERE ("projects"."id" = 3)
---
  def create_interest
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 3)
---
  def destroy_interest
    @project = Project.find(params[:id])